import repository.*;
import service.*;
import utils.Validator;
import view.Menu;

public class App {
    public static void main(String[] args) {

        UserRepository userRepository = new UserRepositoryImpl();
        CheckRepository checkRepository = new CheckRepositoryImpl();
        CourseRepository courseRepository = new CourseRepositoryImpl();
        TransactionRepository transactionRepository = new TransactionRepositoryImpl();

        ServiceCheck serviceCheck = new ServiceCheckImpl(userRepository, checkRepository,
                courseRepository, transactionRepository );
        ServiceCourse serviceCourse = new ServiceCourseImpl(courseRepository);
        ServiceUser serviceUser = new ServiceUserImpl(userRepository,serviceCheck);

        Validator validator = new Validator(serviceUser);
        Menu menu = new Menu(serviceCheck, serviceCourse,serviceUser, userRepository, checkRepository,
                transactionRepository, courseRepository);
        menu.start();
    }
}

/*

    public static final String COLOR_RESET = "\u001B[0m";   //сбросить цвет
    public static final String COLOR_RED = "\u001B[31m";  //красный
    public static final String COLOR_GREEN = "\u001B[32m"; //зеленый
    public static final String COLOR_YELLOW = "\u001B[33m"; //желтый
    public static final String COLOR_BLUE = "\u001B[34m"; //синий
    public static final String COLOR_PURPLE = "\u001B[35m"; //фиолетовый
    public static final String COLOR_CYAN = "\u001B[36m"; //голубой

    public static final String BRIGHT_RED = "\u001B[91m";
    public static final String BRIGHT_GREEN = "\u001B[92m";
    public static final String BRIGHT_YELLOW = "\u001B[93m";
    public static final String BRIGHT_BLUE = "\u001B[94m";
    public static final String BRIGHT_PURPLE = "\u001B[95m";
    public static final String BRIGHT_CYAN = "\u001B[96m";


 */
/*
                  Проект "Обменный пункт валюты"
         Описание проекта:
Разработать консольное приложение для имитации работы обменного пункта валюты.
У одного пользователя могут быть счета в разных валютах (программа должна поддерживать минимум 3 валюты).
Пользователи могут:
регистрировать нового пользователя (аккаунт),
открывать счета в различных валютах (в приложении должна быть поддержка минимум 3 валют),
пополнять счета,
снимать средства со счетов,
закрывать счета,
осуществлять обмен валюты (например, перевод с EUR счета на USD счет с конвертацией по курсу),
а также просматривать историю своих операций.

         Техническое задание:
Многослойная архитектура приложения:
Модель (Model): Определить сущности, такие как пользователь, аккаунт, операция, валюта,
курс валюты и / или другие необходимые объекты.
Сервис (Service): Разработать бизнес-логику приложения, включая управление данными пользователей,
выполнение валютных операций и т.д.
Репозиторий (Repository): Создать слой для взаимодействия с хранилищем данных (например, в памяти или файле(-ах)).

        Организация данных и управление аккаунтами:
Реализовать механизмы для управления данными пользователя, включая их аккаунты и ведение счетов.
У пользователя могут быть счета минимум в 3 разных валютах.

       Управление валютными операциями:
Обеспечить функциональность для осуществления валютных операций, включая пополнение,
обмен и просмотр истории операций.

       Валидация данных:
При регистрации нового пользователя реализовать валидацию введенного email и пароля.
Валидация должна убедиться, что email соответствует стандартному формату электронной почты,
а пароль соответствует заданным критериям безопасности (например, минимальная длина, наличие букв и цифр).

       Пользовательский интерфейс:
Реализовать консольное меню для доступа к функциональности приложения.

       Тестирование:
Разработать JUnit тесты для проверки всех аспектов функциональности приложения,
особое внимание уделить тестированию сервисного слоя.

       Использование коллекции Map:
В процессе разработки приложения активно использовать коллекцию Map для организации и управления данными,
такими как учетные записи пользователей, счета, курсы валют и другие подходящие сценарии.
Например:
Для хранения списка пользователей, где ключом будет id, а значением - пользователь.
Для хранения списка счетов пользователя, где ключом будет идентификатор пользователя, а значением - список его аккаунтов.
Для хранения курсов валют, где ключом будет код валюты, а значением - текущий курс.

       Разделение функциональности по ролям
Пользователь с ролью администратор может, например:
Менять курс валюты
Изменять роль пользователя
Просматривать историю операций пользователей (опционально)
Блокировать пользователя (опционально)

       Исключения:
В случае невозможности выполнить запрашиваемую пользователем операцию,
должно быть выброшено соответсвующее исключение (обработать в слое view и выдать сообщение о природе ошибки пользователю)
В случае провала валидации, приложение должно выбрасывать исключение, которое затем должно быть корректно обработано.
Это может включать информирование пользователя о причине ошибки и предложение повторить попытку ввода данных.

       Опционально:
Возможность сохранения и загрузки данных пользователя (запись / чтение в файл(-ы).
Функционал для просмотра исторических курсов валют (посмотреть историю изменения курса валюты)
Снятие комиссии при каждом переводе
Пользователь может посмотреть историю своих операций
Администратор может посмотреть историю операцию пользователя
Администратор может посмотреть остаток на счетах пользователя
Администратор может заблокировать пользователя - (лишить его возможности совершать операции)
 */

